import pandas as pd

data = {
    'Ученик': ["Владимир", "Владимир", "Алексей", "Сергей", "Эмрах", "Никита", "Света", "Ольга", "Ирина", "Ангелина"],
    'Математика': [5, 4, 4, 5, 3, 5, 4, 3, 2, 5],
    'Русский язык': [4, 5, 4, 5, 2, 5, 4, 3, 3, 5],
    'Литература': [3, 3, 4, 5, 2, 5, 4, 3, 2, 5],
    'Информатика': [5, 5, 4, 5, 3, 5, 4, 3, 3, 4],
    'Физика': [4, 4, 4, 5, 3, 4, 4, 3, 3, 2]
}
df = pd.DataFrame(data)
print(df.head())

mean_scores = df[['Математика', 'Русский язык', 'Литература', 'Информатика', 'Физика']].mean()
print(mean_scores)

median_scores = df[['Математика', 'Русский язык', 'Литература', 'Информатика', 'Физика']].median()
print(median_scores)

Q1 = df['Математика'].quantile(0.25)
Q3 = df['Математика'].quantile(0.75)
IQR_math = Q3 - Q1
print(Q1)
print(Q3)
print(IQR_math)

std_scores = df[['Математика', 'Русский язык', 'Литература', 'Информатика', 'Физика']].std()
print(std_scores)