import pandas as pd

data = {
    'Возраст': [23, 24, 22, 25, 27, 28, 30],
    'Зарплата': [50000, 43000, 54000, 39000, 52000, 48000, 57000]
}

df = pd.DataFrame(data)
print(f'Средний возраст - {df['Возраст'].mean()}')
print(f'Медианный возраст - {df['Возраст'].median()}')
print(f'Стандартное отклонение возраста - {df['Возраст'].std()}')

print(f'Средняя зарплата - {df['Зарплата'].mean()} ')
print(f'Медианная зарплата - {df['Зарплата'].median()}')
print(f'Стандартное отклонение зарплаты - {df['Зарплата'].std()}')